online_results/chunked_prefill_results/llama-2-13b/_256__2000/log_15776594.out
WARNING 02-18 12:13:33 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=46370, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='online_results/chunked_prefill_results/llama-2-13b/_256__2000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=46370 --enable-chunked-prefill --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b --max-num-seqs=256', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  215.93    
Total input tokens:                      500000    
Total generated tokens:                  462000    
Request throughput (req/s):              9.26      
Output token throughput (tok/s):         2139.54   
Total Token throughput (tok/s):          4455.05   
---------------Time to First Token----------------
Mean TTFT (ms):                          101416.31 
Median TTFT (ms):                        99472.94  
P99 TTFT (ms):                           206465.91 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          53.27     
Median TPOT (ms):                        48.67     
P99 TPOT (ms):                           83.90     
---------------Inter-token Latency----------------
Mean ITL (ms):                           53.52     
Median ITL (ms):                         46.28     
P99 ITL (ms):                            63.57     
==================================================
Concurrent checker terminated
Server terminated